In [1]:
!pip install sklearn

Requirement already satisfied: sklearn in c:\users\jaya\anaconda3\envs\tensorflow_env\lib\site-packages (0.0)
Requirement already satisfied: scikit-learn in c:\users\jaya\anaconda3\envs\tensorflow_env\lib\site-packages (from sklearn) (0.20.3)
Requirement already satisfied: scipy>=0.13.3 in c:\users\jaya\anaconda3\envs\tensorflow_env\lib\site-packages (from scikit-learn->sklearn) (1.2.0)
Requirement already satisfied: numpy>=1.8.2 in c:\users\jaya\anaconda3\envs\tensorflow_env\lib\site-packages (from scikit-learn->sklearn) (1.15.4)

In [2]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import r2_score

In [3]:
df=pd.read_csv("Salary_Data.csv")

In [4]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
YearsExperience    30 non-null float64
Salary             30 non-null int64
dtypes: float64(1), int64(1)
memory usage: 560.0 bytes

In [6]:
x=df.iloc[:,0]

In [7]:
x

0      1.1
1      1.3
2      1.5
3      2.0
4      2.2
5      2.9
6      3.0
7      3.2
8      3.2
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.6
15     4.9
16     5.1
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     7.9
23     8.2
24     8.7
25     9.0
26     9.5
27     9.6
28    10.3
29    10.5
Name: YearsExperience, dtype: float64

In [8]:
z=pd.DataFrame(x)
z

    YearsExperience
0               1.1
1               1.3
2               1.5
3               2.0
4               2.2
5               2.9
6               3.0
7               3.2
8               3.2
9               3.7
10              3.9
11              4.0
12              4.0
13              4.1
14              4.6
15              4.9
16              5.1
17              5.3
18              5.9
19              6.0
20              6.8
21              7.1
22              7.9
23              8.2
24              8.7
25              9.0
26              9.5
27              9.6
28             10.3
29             10.5

In [21]:
y=df.iloc[:,-1]

In [20]:
y

0      39343
1      46205
2      37731
3      43525
4      39891
5      56642
6      60150
7      54445
8      64445
9      57189
10     63218
11     55794
12     56957
13     57081
14     61111
15     62302
16     66029
17     83088
18     81363
19     93940
20     91738
21     98273
22    101302
23    113812
24    109431
25    105582
26    116969
27    112635
28    122391
29    121872
Name: Salary, dtype: int64

In [11]:
w=pd.DataFrame(y)
w

    Salary
0    39343
1    46205
2    37731
3    43525
4    39891
5    56642
6    60150
7    54445
8    64445
9    57189
10   63218
11   55794
12   56957
13   57081
14   61111
15   62302
16   66029
17   83088
18   81363
19   93940
20   91738
21   98273
22  101302
23  113812
24  109431
25  105582
26  116969
27  112635
28  122391
29  121872

In [12]:
x_train,x_test,y_train,y_test=train_test_split(z,w,test_size=0.2,random_state=20)

In [13]:
reg= LinearRegression()

In [14]:
reg.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [15]:
sc=StandardScaler()
X_train=sc.fit_transform(x_train)
X_test=sc.fit_transform(x_test)

In [16]:
salary_pred=reg.predict(x_test)
salary_pred

array([[ 64802.59722631],
       [ 46724.57538927],
       [ 38161.30188752],
       [ 62899.64755926],
       [125696.98657214],
       [ 63851.12239278]])

In [17]:
r2_score(y_test,salary_pred)

0.9463090020183532

In [18]:
y_test

    Salary
13   57081
4    39891
1    46205
10   63218
29  121872
12   56957